app/Controllers/Admin/ProdukController.php

    public function kategori()
    {
        $data = [
            "title" => "Daftar Kategori Produk",
            "kategori_produk" => $this->KategoriModel->orderBy('nama_kategori', 'ASC')->findAll()
---
SELECT *
FROM `kategori_produk`
ORDER BY `nama_kategori` ASC